tutorials/immersedBoundary/pitzDailyBodyFitted/0_org/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar>
223
(
7.47386
7.47386
7.47386
7.47386
7.47386
7.47386
7.47386
7.47386
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar>
250
(
5.2557
5.2557
5.2557
5.2557
5.2557
5.2557
5.2557
5.2557
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
