tutorials/immersedBoundary/pitzDailyBodyFitted/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application="simpleFoam"

runApplication blockMesh

mkdir 0
cp -f 0_org/* 0

runApplication potentialFoam
runApplication $application
