tutorials/immersedBoundary/pitzDailyBodyFitted/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;
        tolerance        1e-06;
        relTol           0.01;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-05;
        relTol           0.1;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-05;
        relTol           0.1;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-05;
        relTol           0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|epsilon)"   1e-4;
    }
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
    nuTilda         0.7;
}


// ************************************************************************* //
